'''
- 오늘 동빈이는 여행 가신 부모님을 대신해서 떡집 일을 하기로 했습니다. 오늘은 떡볶이 떡을 만드는 날입니다.
동빈이네 떡볶이 떡은 재밌게도 떡볶이 떡의 길이가 일정하지 않습니다. 대신에 한 봉지 안에 들어가는 떡의 총 길이
는 절단기로 잘라서 맞춰줍니다.
- 절단기에 높이(H)를 지정하면 줄지어진 떡을 한 번에 절단합니다. 높이가 H보다 긴 떡은 H 위의 부분이 잘릴 것이고,
낮은 떡은 잘리지 않습니다.
- 예를 들어 높이가 19, 14, 10, 17cm인 떡이 나란히 있고 절단기 높이를 15cm로 지정하면 자른 뒤 떡의 높이는
15, 14, 10, 15 cm가 될 것입니다. 잘린 떡의 길이는 차례대로 4, 0, 0, 2cm입니다. 손님은 6cm만큼의 길이를 가져갑니다.
- 손님이 왔을 때 요청한 총 길이가 M일 때 적어도 M만큼의 떡을 얻기 위해 절단기에 설정할 수 있는 높이의 최댓값을 구하는
프로그램을 작성하세요.


ex)
4 6
19 15 10 17
출력 15
'''

'''
문제 전략
- 적절한 높이를 찾을 때까지 이진 탐색을 수행하여 높이 H를 반복해서 조정하면 됩니다.
- 현재 이높이로 자르면 조건을 만족할 수 있는가?를 확인한 뒤에 조건의 만족 여부(예 혹은 아니오)에 따라 탐색 범위를 좁혀서 해결할 수 있습니다.
- 절단기의 높이는 0부터 10억까지의 정수 중 하나입니다. -> 이렇게 큰 탐색 범위를 보면 가장 먼저 이진 탐색을 떠올려야 합니다.
- 문제에서 제시된 예시를 통해 그림으로 이해
'''
from tracemalloc import start


N, M = list(map(int, input("떡의 개수와 떡의 길이를 입력하세요 : ").split()))
array = list(map(int,input("떡의 개별 높이를 입력해주세요 : ").split()))
array.sort()


def DDuck(N,M):
    # 이진 탐색을 위한 시작점과 끝점 설정
    start = 0
    end = max(array)
    result = 0
    while start <= end:
        total = 0
        mid = (start+end)//2
        for i in array:
            if i - mid > 0 :
                total += i - mid
        if total == M:
            result = mid
            break
        if total < M: # 필요한 떡의 크기보다 작은경우
            end = mid - 1 # mid의 길이보다 더 작게 잘라야 하므로
        else : # 필요한 떡의 크기보다 작은경우
            start = mid + 1 # mid의 길이보다 더 길게 잘라도 됨으로
            result = mid
    return result

print(DDuck(N,M))